Revit 2026 API

# PointIteratorCurrent Property

---
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual CloudPoint Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As CloudPoint
	Get
```
```cpp
public:
virtual property CloudPoint Current {
	CloudPoint get ();
}
```
```fsharp
abstract Current : CloudPoint with get
override Current : CloudPoint with get
```

#### Property Value

CloudPoint

#### Implements

IEnumeratorTCurrent

#### Reference

PointIterator Class

Autodesk.Revit.DB.PointClouds Namespace